package 类和对象;
/*
* @ 类（class）：是对现实中实体事物的属性和行为的描述，是抽象的，概念上的定义，是一个模板
* @ 对象（instance）：是实际存在的个体，有状态和行为，也称为实例。对象是解决问题的最终工具
*
* @ 类的命名规范：大驼峰（MyClass）
* @ 对象的命名规范：小驼峰（myInstance）
*
* @ 设计类：面向对象的设计重点是类的设计，而设计类其实是【设计类的成员】
*
* @ 创建对象：也叫类的实例化，实例化类
*
* @ 面向对象的具体实现流程：
*   1.创建类，设计类的变量和方法
*   2.创建对象
*   3.通过对象的属性和方法，来调用对象结构
*
* @ 注意事项：
    1.一个源文件【必有且仅能有】一个与文件名相同的类
    2.一个源文件中仅能有一个 public 类，且 public 类名必须与源文件名一致（原因：为了在import公共类时提高效率）
    3.一个源文件可以有多个非 public 类，可以跟文件名不同，但为了为了便于管理，一般一个源文件放一个类
    4.同一个包（同级目录）下不能有重复名称的类
* */
public class Base {
}
